"use client";
import React from "react";
import Navbar from "@/components/functional/navbar";
import Footer from "@/components/ui/footer";
import { User } from "firebase/auth";
import { useState } from "react";
export default function Page() {
  const [user, setUser] = useState<User | null>(null);

  return (
    <>
      <Navbar onUserChange={(user) => setUser(user)} />
      <div className="container mx-auto p-4 my-10">
        <h1 className="text-6xl font-bold mb-8">Политика за поверителност</h1>
        <p className="text-lg ">
          Тази Политика за поверителност е изготвена от Teardrop и чиято
          регистрация е регистрирана в адрес България. Ние се ангажираме да
          защитаваме и опазваме поверителността на нашите посетители, когато
          посещават нашия сайт или комуникират по електронен път при нас. Тази
          политика определя как обработваме всички лични данни, които събираме
          от вас или които вие ни предоставяте чрез нашия уебсайт и сайтове за
          социални медии. Потвърждаваме, че ще запазим вашите защита на
          информацията и пълно съответствие с всички приложими данни за
          Българското Законодателство и разпоредби за защита. Моля, прочетете
          следното внимателно, за да разберете какво се случва с избраните от
          вас лични данни да ни предоставите или които събираме от вас, когато
          посещавате нашия сайтове. С изпращането на информация вие приемате и
          се съгласявате с практиките, описани в тази политика.
        </p>

        <h2 className="text-2xl font-semibold mt-4">
          Типове информация, която събираме
        </h2>
        <p className="text-lg ">
          Можем да събираме, съхраняваме и използваме следните видове лични
          данни информация за лица, които посещават и използват нашия уебсайт и
          социални мрежи медийни сайтове: Информация, която ни предоставяте.
          Може да ни предоставите информация за вас чрез попълване на формуляри
          на нашия уебсайт или в социалните мрежи медии. Това включва
          информация, която предоставяте, когато изпращате a форма за
          контакт/запитване. Информацията, която ни предоставяте може да
          включва, но и не се ограничава до вашето име, адрес, имейл адрес и
          телефонен номер.
        </p>

        <h2 className="text-2xl font-semibold mt-4">
          Използване на информация
        </h2>
        <p className="text-lg ">
          We use the information in the following ways: Information you supply
          to us. We will use this information: to provide you with information
          and/or services that you request from us; To contact you to provide
          the information requested.
        </p>

        <h2 className="text-2xl font-semibold mt-4">
          Съхраняване на информация
        </h2>
        <p className="text-lg ">
          Всяка информация, която ни предоставите, ще бъде изпратена по имейл
          директно до нас или може да се съхранява на защитен сървър. Не
          отдаваме под наем, не продаваме и не споделяме лична информация за вас
          с други хора или несвързани компании. Ние ще положим всички разумни
          усилия, за да гарантираме, че вашият личните данни не се разкриват на
          регионални/национални институции и власти, освен ако не се изисква от
          закон или други разпоредби. За съжаление, предаването на информация
          чрез интернет не е така напълно сигурен. Въпреки че ще направим всичко
          възможно, за да защитим вашите лични данни, не можем да гарантираме
          сигурността на вашите данни предадени на нашия сайт; всяко предаване е
          на ваш собствен риск. След като ние сме получили вашата информация,
          ние ще използваме строги процедури и функции за сигурност, за да се
          опитаме да предотвратим неоторизиран достъп.
        </p>

        <h2 className="text-2xl font-semibold mt-4">Вашите права</h2>
        <p className="text-lg ">
          Имате право да гарантирате, че вашите лични данни се съхраняват
          обработено законно. Вашето право на достъп до темата може да бъде
          упражнено в в съответствие със законите и разпоредбите за защита на
          данните. Ние ще Ви предоставиm Вашите лични данни в законоустановения
          срок рамки. За да ни позволите да проследим всички ваши лични данни,
          които може да сме холдинг, може да се наложи да поискаме допълнителна
          информация от вас.
        </p>

        <h2 className="text-2xl font-semibold mt-4">Промени в политиката</h2>
        <p className="text-lg ">
          Всички промени, които можем да направим в нашата политика за
          поверителност в бъдеще, ще бъдат публикувани на тази страница. Моля,
          проверявайте често, за да видите актуализации или промени в нашата
          политика за поверителност.
        </p>

        <h2 className="text-2xl font-semibold mt-4">Контакт</h2>
        <p className="text-lg ">
          Въпроси, коментари и искания относно тази политика за поверителност са
          добре дошли и трябва да бъдат адресирани до
          teardropjewellery@gmail.com.
        </p>
      </div>

      <Footer />
    </>
  );
}
